Repository: SteveShi/Boxer
Catalog: Resources/mul.lproj/WhatsNew.xcstrings
Source language: en
Languages: zh_hans

source: Continue
zh_hans: 继续

source: Migrated to upstream OpenEmuShaders with pure Swift 6 Metal rendering and upgraded SPIRV compiler toolchains.
zh_hans: 基于 Swift 6 与 Metal 升级了着色器管线，搭载现代化 SPIR-V 编译工具链，带来极致流畅的高帧率呈现。

source: Modern Metal Rendering Pipeline
zh_hans: 现代化 Metal 渲染管线

source: Native Wireless Game Controllers
zh_hans: 原生现代无线手柄支持

source: Seamless support for modern Xbox, PlayStation DualSense, and Nintendo Switch Pro controllers via Apple GameController framework.
zh_hans: 基于 Apple GameController 框架无缝支持 Xbox、PlayStation DualSense 与 Switch Pro 无线手柄。

source: Updated to Munt 2.8.2 for superior Roland MT-32 emulation accuracy and stability.
zh_hans: 升级至最新 Munt 2.8.2 内核，大幅提升 Roland MT-32 仿真精度与音质表现。

source: Upgraded MT32 MIDI Engine
zh_hans: 升级版 MT-32 音频引擎

source: What's New in Boxer
zh_hans: Boxer 新功能

source: DOSBox-Staging 0.83.0 Core
zh_hans: 全新 DOSBox-Staging 0.83.0 内核

source: Upgraded to the latest DOSBox-Staging 0.83.0 engine with modern C++20 architecture, native ARM64 dynamic core, and improved FAT filesystem compatibility.
zh_hans: 仿真核心全面升级至 DOSBox-Staging 0.83.0，深度适配 C++20 架构、原生 ARM64 动态重译核心与全新 FAT 文件系统，仿真精度与稳定性大幅提升。

source: Physical Drive Noise Emulation
zh_hans: 物理驱动器寻道音效仿真

source: Authentic acoustic simulation of vintage 3.5" floppy disk and mechanical hard drive head seek sounds.
zh_hans: 逼真模拟复古 3.5 英寸软盘与机械硬盘的磁头寻道与转动音效，重温经典硬件声音记忆。

source: Roland Sound Canvas (SC-55)
zh_hans: Roland Sound Canvas (SC-55) 仿真

source: Integrated Nuked-SC55 emulation plugin with automatic ROM detection in Application Support.
zh_hans: 全新集成 Nuked-SC55 仿真插件，自动扫描 Application Support 目录下的 ROM 文件，带来极具临场感的通用 MIDI 乐声。

source: FMV Deinterlacing & MDS Disc Support
zh_hans: 全动态视频去隔行与 MDS 镜像支持

source: Adaptive scanline deinterlacing for FMV cutscenes and seamless mounting of multi-track MDS/MDF images.
zh_hans: 支持全动态过场动画自适应去隔行平滑处理，并原生兼容多音轨 MDS/MDF 光盘镜像无损挂载。
